app/views/brand/_first_part.html.erb

SELECT "brands".* FROM "brands"
---
		<%= label_tag "brand_id", "Marca:" %><br />
		<%= select_tag "brand_id", options_from_collection_for_select(Brand.all, :id, :name), :prompt => "Elija una marca"  %>