app/views/output_code/search.html.erb

SELECT "document_types".* FROM "document_types"
---
		<%= label_tag "doc_type", "Tipo de Documento: "%><br/>
		<%= select_tag "doc_type", options_from_collection_for_select(DocumentType.all, :id, :name) %>