app/views/devise/registrations/new.html.erb

SELECT "roles".* FROM "roles"
---
    <div class="new_user_form_field roles">
    	<% for role in Role.all %>

SELECT "stores".* FROM "stores"
---
      <%= f.label :store_id, "Local" %>
      <%= f.collection_select :store_id, Store.all, :id, :name %>