app/views/entry_folders/_entry_documents_field.html.erb

SELECT "document_types".* FROM "document_types"
---
    <%= data.label :document_type_id, "Tipo de Documento" %>
    <%= data.collection_select :document_type_id, DocumentType.all, :id, :name %>