app/views/entry_folders/_entry_document_details_field.html.erb

SELECT "units".* FROM "units"
---
    <%= data.label :unit_id, "Unidad" %>
    <%= data.collection_select :unit_id, Unit.all, :id, :name %>