app/views/entry_folders/edit.html.erb

SELECT "models".* FROM "models"
---
				<%= label_tag "search_param", "Modelo:" %><br/>
				<%= datalist_text_field_tag "search_param", nil, "model_list", Model.all %>