app/views/entry_folders/index.html.erb

            <% docs.each do |doc| %>
              <% doc.entry_documents.each do |d| %>
---
SELECT "entry_documents".* FROM "entry_documents" WHERE "entry_documents"."entry_folder_id" = 48