app/views/entry_folders/show.html.erb

SELECT "entry_documents".* FROM "entry_documents" WHERE "entry_documents"."entry_folder_id" = 49
---
	<div id="ef_show_document_part">
		<% @entry_folder.entry_documents.each do |doc| %>

SELECT "entry_document_details".* FROM "entry_document_details" WHERE "entry_document_details"."entry_folder_id" = 49
---
	<div id="ef_show_document_detail_part">
		<% @entry_folder.entry_document_details.each do |dd| %>