app/views/clients/_form.html.erb

SELECT "client_types".* FROM "client_types"
---
    <%= f.label :client_type_id, "Tipo de Cliente" %><br />
    <%= f.collection_select :client_type_id, ClientType.all, :id, :name %>