app/views/output_folders/_output_document_details_field.html.erb

SELECT "price_types".* FROM "price_types"
---
    <%= data.label :sell_price, "Precio de Venta: " %>
    <%= select_tag "price_type", options_from_collection_for_select( PriceType.all, :id, :name), :class => "sell_price" %>

SELECT "units".* FROM "units"
---
    <%= data.label :unit_id, "Unidad" %>
    <%= data.collection_select :unit_id, Unit.all, :id, :name %>