app/views/output_folders/_output_documents_field.html.erb

SELECT "document_types".* FROM "document_types"
---
    <%= data.label :document_type_id, "Tipo de Documento" %><br />
    <%= data.collection_select :document_type_id, DocumentType.all, :id, :name %>