app/views/output_folders/index.html.erb

SELECT "folder_states".* FROM "folder_states" LIMIT 1
---
  <ul id="of_inner_nav_bar">
    <% FolderState.all.each do |fs|%>