app/views/output_folders/new.html.erb

SELECT "client_types".* FROM "client_types"
---
				<div id="radio_part" class="form_div">
					<% ClientType.all.each do |ct| %>

SELECT DISTINCT model_id FROM "products"
---
					<%= label_tag "modelo", "Modelo:" %><br>
					<%= second_datalist_text_field_tag "modelo", "model_list", Product.select(:model_id).uniq %>