app/views/output_folders/show.html.erb

	<div id="document_part">
		<% @output_folder.output_documents.each do |doc| %>
---
SELECT "output_documents".* FROM "output_documents" WHERE "output_documents"."output_folder_id" = 6

	<div id="document_detail_part">
		<% @output_folder.output_document_details.each do |dd| %>
---
SELECT "output_document_details".* FROM "output_document_details" WHERE "output_document_details"."output_folder_id" = 6