app/views/quotations/search_stock.js.erb

SELECT "models".* FROM "models" WHERE "models"."id" = 70 LIMIT 1
---
	$("#the_image_goes_here").find("img").attr("src", "<%= @product.image.url(:medium) %>");
	$("#the_image_goes_here #up").find("h2").html("<%= @product.model.name %>");