app/views/quotations/show.html.erb

SELECT "quotation_details".* FROM "quotation_details" WHERE "quotation_details"."quotation_id" = 9
---
      <% tmp = 0 %>
      <% @quotation.quotation_details.each do |qd| %>

SELECT "money_types".* FROM "money_types"
---
            <%= label_tag "money_type", "Tipo de Dinero: " %>
            <%= select_tag "money_type", options_from_collection_for_select(MoneyType.all, :id, :name) %>

SELECT "document_types".* FROM "document_types"
---
            <div>
              <% DocumentType.all.each do |dt| %>