app/views/sell_price/register.html.erb

					<tr>
						<td rowspan=<%= PriceType.count %>><%= edd.product.full_name %></td>
---
SELECT "price_types".* FROM "price_types" LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 16 LIMIT 1
SELECT COUNT(*) FROM "price_types"