app/controllers/brand_controller.rb

   def index
    hash = Hash.new
    second_hash = Hash.new
    @third_hash = Hash.new

    Brand.all.each do |brand|
      ParentModel.all.each do |pm|
        pm.model_types.each do |mt|
---
SELECT "brands".* FROM "brands"
SELECT "parent_models".* FROM "parent_models"
SELECT "models".* FROM "models" WHERE "models"."brand_id" = 22 AND "models"."model_type_id" = 13

  def parent_model_index
    @parent_model = ParentModel.all
---
SELECT "parent_models".* FROM "parent_models"

  def create
    @new_brand = Brand.new
    @new_brand.name = unless params[:name].nil?
                        params[:name].upcase
                      end
    authorize! :create, Brand.new
    respond_to do |f|
      if @new_brand.save
---
INSERT INTO "brands" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 18 Jan 2013 11:56:01 UTC +00:00], ["name", "NINO"], ["updated_at", Fri, 18 Jan 2013 11:56:01 UTC +00:00]]

  def create_model_one
    @model_types = ModelType.where(:parent_model_id => params[:parent])
---
SELECT "model_types".* FROM "model_types" WHERE "model_types"."parent_model_id" = 13

  def create_model
    @new_model = Model.new
    @new_model.brand_id = params[:brand_id]
    @new_model.model_type_id = params[:model_type_id]
    @new_model.name = params[:name].upcase
    authorize! :create, Model.new
    respond_to do |f|
      if @new_model.save
---
INSERT INTO "models" ("brand_id", "created_at", "model_type_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brand_id", 23], ["created_at", Fri, 18 Jan 2013 11:56:25 UTC +00:00], ["model_type_id", 13], ["name", "747K"], ["updated_at", Fri, 18 Jan 2013 11:56:25 UTC +00:00]]

  def create_class
    @new_class = ParentModel.new
    @new_class.name = unless params[:name].nil?
                        params[:name].upcase
                      end
    respond_to do |f|
      if @new_class.save
---
INSERT INTO "parent_models" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 19 Jan 2013 16:43:27 UTC +00:00], ["name", "RECTA"], ["updated_at", Sat, 19 Jan 2013 16:43:27 UTC +00:00]]

  def create_model_type
    @new_model_type = ModelType.new
    @new_model_type.parent_model_id = unless params[:parent].nil?
                                        params[:parent].upcase
                                      end
    @new_model_type.name = unless params[:name].nil?
                        params[:name].upcase
                      end
    respond_to do |f|
      if @new_model_type.save
---
INSERT INTO "model_types" ("created_at", "name", "parent_model_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 19 Jan 2013 16:43:51 UTC +00:00], ["name", "STANDAR"], ["parent_model_id", 14], ["updated_at", Sat, 19 Jan 2013 16:43:51 UTC +00:00]]