app/controllers/clients_controller.rb

  def show
    @client = Client.find(params[:id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "4"]]

  def create
    @client = Client.new(params[:client])
    @client.client_type_id = params[:client_type_id]

    respond_to do |format|
      if @client.save
---
INSERT INTO "clients" ("DNI", "RUC", "address", "client_type_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def search
    ct = ClientType.find(params[:client_type])
    number = params[:number]
    @client = Client.find(:all, :conditions => ["identification_number like ?", "%" + number + "%"])
---
SELECT "client_types".* FROM "client_types" WHERE "client_types"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "clients".* FROM "clients" WHERE (DNI like '%45951893%')