app/controllers/client_type_controller.rb

  def index
    @ct = ClientType.all
---
SELECT "client_types".* FROM "client_types"