app/controllers/clients_controller.rb

  def search

    ct = ClientType.find(params[:client_type])
    number = params[:number]

    if ct == ClientType.first
---
SELECT "client_types".* FROM "client_types" LIMIT 1