app/controllers/document_type_controller.rb

  def index
    @dt = DocumentType.all
---
SELECT "document_types".* FROM "document_types"