app/controllers/entry_code_controller.rb

SELECT "document_types".* FROM "document_types" WHERE "document_types"."id" = ? LIMIT 1  [["id", "15"]]
SELECT "entry_documents".* FROM "entry_documents" WHERE "entry_documents"."numeration" = '141414' AND "entry_documents"."document_type_id" = 15
SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT 1  [["id", "3"]]
---
  def result

  	doc_type = DocumentType.find(params[:doc_type])
  	@result = EntryDocument.where(:numeration => params[:numbers], :document_type_id => doc_type).all

    supplier = Supplier.find(params[:supplier])

SELECT "entry_documents".* FROM "entry_documents" WHERE "entry_documents"."id" = ? LIMIT 1  [["id", "51"]]
---
  def register
    doc = EntryDocument.find(params[:doc_register_id])

SELECT "entry_folders".* FROM "entry_folders" WHERE "entry_folders"."id" = ? LIMIT 1  [["id", "48"]]
SELECT "entry_document_details".* FROM "entry_document_details" WHERE "entry_document_details"."entry_folder_id" = 48
SELECT "entry_codes".* FROM "entry_codes" WHERE "entry_codes"."id" = ? LIMIT 1  [["id", 1652]]
UPDATE "entry_codes" SET "original_code" = '', "updated_at" = '2013-01-17 10:54:30.224598' WHERE "entry_codes"."id" = 1652
---
  def save_codes
    folder = EntryFolder.find(params[:folder_id])
    folder.entry_document_details.each do |dd|
      dd.entry_codes.each do |ec|
        new_ec = EntryCode.find(ec.id)
        new_ec.original_code = params["code_"+ec.id.to_s]
        new_ec.save

SELECT "entry_folders".* FROM "entry_folders" WHERE "entry_folders"."id" = ? LIMIT 1  [["id", "48"]]
---
  def show
    @folder = EntryFolder.find(params[:folder_id])