app/controllers/entry_folders_controller.rb

SELECT "entry_folders".* FROM "entry_folders" WHERE "entry_folders"."id" = ? LIMIT 1  [["id", "49"]]
---
  def show
    @entry_folder = EntryFolder.find(params[:id])

SELECT "entry_folders".* FROM "entry_folders" WHERE "entry_folders"."id" = ? LIMIT 1  [["id", "48"]]
---
  def edit
    @entry_folder = EntryFolder.find(params[:id])

INSERT INTO "entry_folders" ("created_at", "date", "folder_state_id", "supplier_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 19 Jan 2013 10:18:30 UTC +00:00], ["date", Sat, 19 Jan 2013], ["folder_state_id", 1], ["supplier_id", 3], ["updated_at", Sat, 19 Jan 2013 10:18:30 UTC +00:00], ["user_id", 1]]
---
  def create
    @entry_folder = EntryFolder.new(params[:entry_folder])

    respond_to do |format|
      if @entry_folder.save

SELECT "entry_folders".* FROM "entry_folders" WHERE "entry_folders"."id" = ? LIMIT 1  [["id", "48"]]
---
  def update
    @entry_folder = EntryFolder.find(params[:id])

SELECT "suppliers".* FROM "suppliers" WHERE (name like '%ke%')
---
  def search_supplier
    name = params[:name]
    @suppliers = Supplier.find(:all, :conditions => ["name like ?", "%" + name + "%"])

SELECT "models".* FROM "models" WHERE "models"."name" = '737K'
SELECT "products".* FROM "products" WHERE "products"."model_id" = 70 LIMIT 1
---
  def search_product
    model_name = params[:model]
    model = Model.where(:name => model_name).all
    @products = Hash.new
    model.each do |m|
      @products[m] = Product.where(:model_id => m).first