app/controllers/output_folders_controller.rb

  def index

    @response = Hash.new

    FolderState.all.each do |fs|
      tmp = OutputFolder.where(:folder_state_id => fs)
      unless(tmp.empty?)
---
SELECT "folder_states".* FROM "folder_states" LIMIT 1
SELECT "output_folders".* FROM "output_folders" WHERE "output_folders"."folder_state_id" = 1
SELECT "output_folders".* FROM "output_folders"
SELECT COUNT(*) FROM "output_folders" WHERE "output_folders"."folder_state_id" = 1

  def show
    @output_folder = OutputFolder.find(params[:id])
---
SELECT "output_folders".* FROM "output_folders" WHERE "output_folders"."id" = ? LIMIT 1  [["id", "6"]]

  def edit
    @output_folder = OutputFolder.find(params[:id])
---
SELECT "output_folders".* FROM "output_folders" WHERE "output_folders"."id" = ? LIMIT 1  [["id", "6"]]

  def create
    @output_folder = OutputFolder.new(params[:output_folder])

    respond_to do |format|
      if @output_folder.save
        OutputCode.createOutputCodes(@output_folder)
---
INSERT INTO "output_folders" ("client_id", "created_at", "date", "folder_state_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["client_id", 1], ["created_at", Sat, 19 Jan 2013 14:25:37 UTC +00:00], ["date", Sat, 19 Jan 2013], ["folder_state_id", 1], ["updated_at", Sat, 19 Jan 2013 14:25:37 UTC +00:00], ["user_id", 1]]
INSERT INTO "output_codes" ("created_at", "output_document_detail_id", "registered_code", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 19 Jan 2013 14:25:37 UTC +00:00], ["output_document_detail_id", 6], ["registered_code", nil], ["updated_at", Sat, 19 Jan 2013 14:25:37 UTC +00:00]]

  def update
    @output_folder = OutputFolder.find(params[:id])

    respond_to do |format|
      if @output_folder.update_attributes(params[:output_folder])
        if(@output_folder.folder_state_id == FolderState.last.id)
---
SELECT "output_folders".* FROM "output_folders" WHERE "output_folders"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "output_folders" SET "user_id" = 8, "folder_state_id" = 2, "updated_at" = '2013-03-21 13:50:02.460461' WHERE "output_folders"."id" = 16
SELECT "folder_states".* FROM "folder_states" ORDER BY "folder_states"."id" DESC LIMIT 1