app/controllers/output_code_controller.rb

  def result

    doc_type = DocumentType.find(params[:doc_type])
    @result = OutputDocument.where(:numeration => params[:numbers], :document_type_id => doc_type).all
---
SELECT "document_types".* FROM "document_types" WHERE "document_types"."id" = ? LIMIT 1  [["id", "15"]]
SELECT "output_documents".* FROM "output_documents" WHERE "output_documents"."numeration" = '123' AND "output_documents"."document_type_id" = 15

  def register
    doc = OutputDocument.find(params[:doc_register_id])
---
SELECT "output_documents".* FROM "output_documents" WHERE "output_documents"."id" = ? LIMIT 1  [["id", "7"]]

  def save_codes
    folder = OutputFolder.find(params[:folder_id])
    folder.output_document_details.each do |dd|
---
SELECT "output_folders".* FROM "output_folders" WHERE "output_folders"."id" = ? LIMIT 1  [["id", "22"]]
SELECT "output_document_details".* FROM "output_document_details" WHERE "output_document_details"."output_folder_id" = 22

  def show
    @folder = OutputFolder.find(params[:folder_id])
---
SELECT "output_folders".* FROM "output_folders" WHERE "output_folders"."id" = ? LIMIT 1  [["id", "22"]]