app/controllers/output_code_controller.rb

SELECT "quotations".* FROM "quotations" WHERE "quotations"."code" = 'fyAFKr' LIMIT 1
---
  def result

    q = Quotation.find_by_code(params[:numbers].to_s)

SELECT "output_folders".* FROM "output_folders" WHERE "output_folders"."id" = 7 LIMIT 1
---
  def register
    @folder = OutputFolder.find(params[:doc_register_id])