app/controllers/price_type_controller.rb

SELECT "price_types".* FROM "price_types"
---
  def index
  	@pt = PriceType.all

INSERT INTO "price_types" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 19 Jan 2013 17:40:17 UTC +00:00], ["name", "distribuidor"], ["updated_at", Sat, 19 Jan 2013 17:40:17 UTC +00:00]]
---
  def create
  	@new_pt = PriceType.new
    @new_pt.name = params[:name]
    authorize! :create, @new_pt
    respond_to do |f|
      if @new_pt.save

SELECT "price_types".* FROM "price_types" WHERE "price_types"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "price_types" WHERE "price_types"."id" = ?  [["id", 5]]
---
  def destroy
  	@del_pt = PriceType.find(params[:pt_id])
    @del_pt.destroy

SELECT "price_types".* FROM "price_types" WHERE "price_types"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "price_types" SET "name" = 'por mayor', "updated_at" = '2013-01-17 07:28:20.577521' WHERE "price_types"."id" = 2
---
  def update
  	@up_pt = PriceType.find(params[:pt_id])
    @up_pt.name = params[:new_value]
    authorize! :update, @up_pt
    respond_to do |f|
      if @up_pt.save