app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "model_id", "monthly_price", "monthly_quantity", "product_type_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "model_types".* FROM "model_types" WHERE "model_types"."id" = ? LIMIT 1  [["id", "13"]]
---
  def model_changer
    brand = Brand.where(:name => params[:brand_id].upcase)
    model_type = ModelType.find(params[:model_type_id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "16"]]
SELECT "sell_prices".* FROM "sell_prices" WHERE "sell_prices"."product_id" = 16
---
  def sell_price

    @product = Product.find(params[:id])
    @sell_prices = SellPrice.where(:product_id => @product)

SELECT "price_types".* FROM "price_types"
SELECT "sell_prices".* FROM "sell_prices" WHERE "sell_prices"."product_id" = 16 AND "sell_prices"."price_type_id" = 1 LIMIT 1
INSERT INTO "sell_prices" ("created_at", "price_type_id", "product_id", "sell_price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 18 Jan 2013 04:22:25 UTC +00:00], ["price_type_id", 1], ["product_id", 16], ["sell_price", 100.0], ["updated_at", Fri, 18 Jan 2013 04:22:25 UTC +00:00]]
---
  def register_sell_price

    PriceType.all.each do |pt|
      sp = SellPrice.where(:product_id => params[:prod_id], :price_type_id => pt).first
      if sp.nil?
        sp = SellPrice.new
        sp.product_id = params[:prod_id]
        sp.price_type_id = pt.id
      end
      sp.sell_price = params[pt.name]
      sp.save

SELECT "models".* FROM "models" WHERE (name like '%73%')
SELECT "products".* FROM "products" WHERE "products"."model_id" = 70 LIMIT 1
SELECT "stocks".* FROM "stocks" WHERE "stocks"."product_id" = 16
SELECT COUNT(*) FROM "stocks" WHERE "stocks"."product_id" = 16
---
  def search_for_stock

    mod = params[:modelo]
    @products = Array.new

    models = Model.where(["name like ?", "%#{mod}%"])
    models.each do |model|
      product = Product.where(:model_id => model).first
      unless product.nil?
        @products << product
      end
    end

    @response = Hash.new

    @products.each do |product|
      stock = Stock.where(:product_id => product)
      unless stock.empty?