app/controllers/quotations_controller.rb

SELECT "quotation_details".* FROM "quotation_details" WHERE "quotation_details"."quotation_id" = 9
SELECT "money_types".* FROM "money_types"
---
  def show
    @quotation = Quotation.find(params[:id])

    total = 0
    @quotation.quotation_details.each do |qd|
      total = total + qd.sell_price * qd.quantity * qd.money_value
    end

    @quotation_value = {}
    MoneyType.all.each do |mt|

INSERT INTO "quotation_details" ("created_at", "product_id", "quantity", "quotation_id", "sell_price", "unit_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @quotation = Quotation.new(params[:quotation])

    #Code for quotation
    @quotation.code = Time.now.to_i.to_s[5,10]
    @quotation.payment_status = false

    total = 0
    @quotation.quotation_details.each do |qd|
      total = total + (qd.sell_price * qd.money_value)
    end

    @quotation.money_expected = total

    respond_to do |format|
      if @quotation.save