app/controllers/quotations_controller.rb

  def show
    @quotation = Quotation.find(params[:id])
---
SELECT "quotations".* FROM "quotations" WHERE "quotations"."id" = ? LIMIT 1  [["id", "9"]]

  def new
    @quotation = Quotation.new
    @clients = Client.all
---
SELECT "clients".* FROM "clients"

  def create
    @quotation = Quotation.new(params[:quotation])

    o =  [('a'..'z'),('A'..'Z')].map{|i| i.to_a}.flatten
    string  =  (0...6).map{ o[rand(o.length)] }.join
    @quotation.code = string

    respond_to do |format|
      if @quotation.save
---
INSERT INTO "quotations" ("client_id", "code", "created_at", "date", "money_expected", "money_received", "money_returned", "money_type_id", "payment_status", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def search_product

    temp = params[:qp_search_input].split(" ")
    @response = []
    if temp.length == 3
      pt = temp[0].upcase
      b = temp[1].upcase
      pm = temp[2].upcase

      b = Brand.where("name like ?", "%"+b+"%").first
      pt = ProductType.where("name like ?", "%"+pt+"%").first
      pm = ParentModel.where("name like ?", "%"+pm+"%").first

      pm.model_types.each do |mt|
        tmp = Model.where(:model_type_id => mt, :brand_id => b)
        tmp.each do |m|
---
SELECT "brands".* FROM "brands" WHERE (name like '%SIRUBA%') LIMIT 1
SELECT "product_types".* FROM "product_types" WHERE (name like '%MAQUINA%') LIMIT 1
SELECT "models".* FROM "models" WHERE (name like '%737K%')
SELECT "parent_models".* FROM "parent_models" WHERE (name like '%REMALLADORA%') LIMIT 1
SELECT "model_types".* FROM "model_types" WHERE "model_types"."parent_model_id" = 13
SELECT "models".* FROM "models" WHERE "models"."model_type_id" = 13 AND "models"."brand_id" = 22
SELECT "models".* FROM "models" WHERE "models"."id" = 68 LIMIT 1

  def search_stock

    user_id = params[:user_id]
    p_id = params[:product_id]

    store = User.find(user_id).store

    @product = Product.find(p_id)
    @stock = Stock.where(product_id: p_id).all
    @price = SellPrice.where(product_id: p_id).all
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 8 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "16"]]
SELECT "stocks".* FROM "stocks" WHERE "stocks"."product_id" = 16
SELECT "sell_prices".* FROM "sell_prices" WHERE "sell_prices"."product_id" = 16

  def pay_quotation

    q = Quotation.find(params[:q_id])

    q.money_expected = params[:mexpected].to_f
    q.money_received = params[:mreceived].to_f
    q.money_returned = params[:mreturned].to_f
    q.payment_status = true

    documents = []
    DocumentType.all.each do |dt|
      unless params[dt.id.to_s].nil?
        documents << dt
      end
    end

    #Create OutputFolder
    @of = OutputFolder.new
    @of.client = q.client
    @of.date = Time.now
    @of.folder_state = FolderState.last
    @of.user = q.user
    @of.quotation = q
    @of.save
---
SELECT "quotations".* FROM "quotations" WHERE "quotations"."id" = ? LIMIT 1  [["id", "13"]]
SELECT "document_types".* FROM "document_types"
SELECT "folder_states".* FROM "folder_states" ORDER BY "folder_states"."id" DESC LIMIT 1
INSERT INTO "output_folders" ("client_id", "created_at", "date", "folder_state_id", "quotation_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

    end

    #Create OuputDocumentDetail
    q.quotation_details.each do |qd|
---
SELECT "quotation_details".* FROM "quotation_details" WHERE "quotation_details"."quotation_id" = 13


    respond_to do |format|
      if q.save
        OutputCode.createOutputCodes(@of)
---
INSERT INTO "output_codes" ("created_at", "output_document_detail_id", "registered_code", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 21 Mar 2013 13:55:00 UTC +00:00], ["output_document_detail_id", 17], ["registered_code", nil], ["updated_at", Thu, 21 Mar 2013 13:55:00 UTC +00:00]]

  def auth_user

    user_id = params[:user_to_auth]
    small_code = params[:small_code]

    user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1