app/controllers/sell_price_controller.rb

SELECT "document_types".* FROM "document_types" WHERE "document_types"."id" = ? LIMIT 1  [["id", "15"]]
SELECT "entry_documents".* FROM "entry_documents" WHERE "entry_documents"."numeration" = '' AND "entry_documents"."document_type_id" = 15
---
  def result

    doc_type = DocumentType.find(params[:doc_type])
    @result = EntryDocument.where(:numeration => params[:numbers], :document_type_id => doc_type).all

SELECT "entry_documents".* FROM "entry_documents" WHERE "entry_documents"."id" = ? LIMIT 1  [["id", "51"]]
---
  def register
    doc = EntryDocument.find(params[:doc_register_id])