app/views/products/_form.html.erb

SELECT "brands".* FROM "brands"
SELECT "models".* FROM "models"
---
    <%= label_tag "brand_id", "Marca: " %>
    <%= datalist_text_field_tag "brand_id", @product.model.nil? ? "" : @product.model.brand.name , "midorys", Brand.all %>

SELECT "parent_models".* FROM "parent_models"
---
    <%= label_tag "myClass", "Clase: " %>
    <%= select_tag "myClass", options_from_collection_for_select(ParentModel.all, :id, :name, ParentModel.first.id) %>

SELECT "model_types".* FROM "model_types" WHERE "model_types"."parent_model_id" = 13
---
    <%= label_tag "model_type_id", "Sub-Clase: " %>
    <%= select_tag "model_type_id", option_groups_from_collection_for_select(ParentModel.all, :model_types, :name, :id, :name, ParentModel.first.id) %>

SELECT "product_types".* FROM "product_types"
---
      <%= f.label :product_type_id, "Tipo de Producto:" %>
      <%= f.collection_select :product_type_id, ProductType.all, :id, :name %>