app/views/products/sell_price.html.erb

			</tr>
			<% PriceType.all.each do |pt| %>
---
SELECT "price_types".* FROM "price_types"